Repository: Mantix/perfect-content-wordpress-plugin
Catalog: languages/perfect-content-connector-*.po
Languages: nl_nl

source: Perfect Content Settings
nl_nl: Perfect Content Instellingen

source: API Configuration
nl_nl: API Configuratie

source: Use these settings in your Perfect Content dashboard to connect your WordPress site.
nl_nl: Gebruik deze instellingen in je Perfect Content dashboard om je WordPress site te verbinden.

source: Copy this URL to your Perfect Content dashboard.
nl_nl: Kopieer deze URL naar je Perfect Content dashboard.

source: API Key
nl_nl: API Sleutel

source: Regenerate Key
nl_nl: Sleutel Opnieuw Genereren

source: Copy this key to your Perfect Content dashboard.
nl_nl: Kopieer deze sleutel naar je Perfect Content dashboard.

source: About Perfect Content
nl_nl: Over Perfect Content

source: Perfect Content is a web application that generates high-quality content using AI and allows professionals to review and edit the content before publishing.
nl_nl: Perfect Content is een webapplicatie die hoogwaardige content genereert met behulp van AI en professionals in staat stelt om de content te beoordelen en te bewerken voordat deze wordt gepubliceerd.

source: Visit Perfect Content
nl_nl: Bezoek Perfect Content

source: Go to Dashboard
nl_nl: Ga naar Dashboard

source: In your Perfect Content dashboard, go to "Edit" your company and fill in the API endpoint and API key from above.
nl_nl: Ga in je Perfect Content dashboard naar "Bewerk" je bedrijf en vul de API endpoint en API sleutel van hierboven in.

source: Are you sure you want to regenerate the API key? This will break the connection with Perfect Content until you update the key in your dashboard.
nl_nl: Weet je zeker dat je de API sleutel opnieuw wilt genereren? Dit zal de verbinding met Perfect Content verbreken totdat je de sleutel in je dashboard bijwerkt.

source: API key regenerated successfully!
nl_nl: API sleutel succesvol opnieuw gegenereerd!

source: Error regenerating API key.
nl_nl: Fout bij het opnieuw genereren van de API sleutel.

source: You do not have permission to perform this action.
nl_nl: Je hebt geen toestemming om deze actie uit te voeren.

source: Invalid API key
nl_nl: Ongeldige API sleutel

source: Title and body are required
nl_nl: Titel en inhoud zijn verplicht

source: Failed to create post
nl_nl: Het maken van de post is mislukt

source: Post created successfully
nl_nl: Post succesvol aangemaakt

source: Connection Status:
nl_nl: Verbindingsstatus:

source: Ready to receive content
nl_nl: Klaar om content te ontvangen

source: Configuration incomplete
nl_nl: Configuratie onvolledig
